---
kind: property
id: P:Autodesk.Revit.DB.Architecture.StairsRunType.NosingLength
source: html/df67964e-9f7b-f4b8-5b67-4e2faf985853.htm
---
# Autodesk.Revit.DB.Architecture.StairsRunType.NosingLength Property

The amount of the tread depth that overhangs the next tread.

## Syntax (C#)
```csharp
public double NosingLength { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The given value for length must be between 0 and 30000 feet.